package com.homework.tasks;

//Задача 2: Инициализация переменных для заданных значений
//Создайте переменные подходящих типов для хранения следующих значений:



class task2{
    public static void main(String args[]){

        double metres = 27.12;
        long dollars = 987678965549L;
        float litres = 2.786f;
        int trains = 569;
        int Fahrenheit = -159;
        short bugs = 27897;
        byte fingers = 67;


        System.out.println("Значение переменной [metres] с типом [double] равно " + metres);
        System.out.println("Значение переменной [dollars] с типом [long] равно " + dollars);
        System.out.println("Значение переменной [litres] с типом [float] равно " + litres);
        System.out.println("Значение переменной [trains] с типом [int] равно " + trains);
        System.out.println("Значение переменной [Fahrenheit] с типом [int] равно " + Fahrenheit);
        System.out.println("Значение переменной [bugs] с типом [short] равно " + bugs);
        System.out.println("Значение переменной [fingers] с типом [byte] равно " + fingers);

    }
}